Revit 2025 API
WaterTintEnableType Enumeration
 The enumerated type representing the permitted values for the asset property "WaterTintEnable" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WaterTintEnableType
Public Enumeration WaterTintEnableType
public enum class WaterTintEnableType
type WaterTintEnableType
Members
Member name | Value | Description
Tropical | 0
Algae | 1
Murky | 2
ReflectingPool | 3
River | 4
Lake | 5
Ocean | 6
Custom | 7
See Also
Reference
Autodesk.Revit.DB.Visual Namespace